#+EXPORT_EXCLUDE_TAGS: noexport

*** Create Cloudflare Pages deployment

Create Cloudflare Pages deployment deploys a directory of static assets as a
Pages deployment.

It is implemented in bash and a standalone example can be tested and viewed:

The implementation uses Cloudflare Wrangler CLI tool which is an npm package.

#+begin_src sh :colnames '("Name" "Homepage" "Description") :exports none
npm info wrangler@2.0.29 --category name homepage description --json | gojq -r '[ .name, .homepage, .description ] | @csv'
#+end_src

#+RESULTS:
| Name     | Homepage                                       | Description                                              |
|----------+------------------------------------------------+----------------------------------------------------------|
| wrangler | https://github.com/cloudflare/wrangler2#readme | Command-line interface for all things Cloudflare Workers |

